<template>
  <div class="chart-list">
    <chart
      class="chart-list_item"
      v-for="(item,index) in list"
      :key="index"
      :data="item"
      title="123"
      @click-detail="onViewDetail"
    ></chart>
  </div>
</template>

<script>
import Chart from '../components/chart'
export default {
  components: { Chart },
  data() {
    return {
      list: [
        // {
        //   columns: ['日期', '销售额-1季度', '销售额-2季度', '占比', '其他'],
        //   rows: [
        //     {
        //       日期: '1月1日',
        //       '销售额-1季度': 1523,
        //       '销售额-2季度': 1523,
        //       占比: 0.12,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月2日',
        //       '销售额-1季度': 1223,
        //       '销售额-2季度': 1523,
        //       占比: 0.345,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月3日',
        //       '销售额-1季度': 2123,
        //       '销售额-2季度': 1523,
        //       占比: 0.7,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月4日',
        //       '销售额-1季度': 4123,
        //       '销售额-2季度': 1523,
        //       占比: 0.31,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月5日',
        //       '销售额-1季度': 3123,
        //       '销售额-2季度': 1523,
        //       占比: 0.12,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月6日',
        //       '销售额-1季度': 7123,
        //       '销售额-2季度': 1523,
        //       占比: 0.65,
        //       其他: 100,
        //     },
        //   ],
        // },
        // {
        //   columns: ['日期', '销售额-1季度', '销售额-2季度', '占比', '其他'],
        //   rows: [
        //     {
        //       日期: '1月1日',
        //       '销售额-1季度': 1523,
        //       '销售额-2季度': 1523,
        //       占比: 0.12,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月2日',
        //       '销售额-1季度': 1223,
        //       '销售额-2季度': 1523,
        //       占比: 0.345,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月3日',
        //       '销售额-1季度': 2123,
        //       '销售额-2季度': 1523,
        //       占比: 0.7,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月4日',
        //       '销售额-1季度': 4123,
        //       '销售额-2季度': 1523,
        //       占比: 0.31,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月5日',
        //       '销售额-1季度': 3123,
        //       '销售额-2季度': 1523,
        //       占比: 0.12,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月6日',
        //       '销售额-1季度': 7123,
        //       '销售额-2季度': 1523,
        //       占比: 0.65,
        //       其他: 100,
        //     },
        //   ],
        // },
        // {
        //   columns: ['日期', '销售额-1季度', '销售额-2季度', '占比', '其他'],
        //   rows: [
        //     {
        //       日期: '1月1日',
        //       '销售额-1季度': 1523,
        //       '销售额-2季度': 1523,
        //       占比: 0.12,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月2日',
        //       '销售额-1季度': 1223,
        //       '销售额-2季度': 1523,
        //       占比: 0.345,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月3日',
        //       '销售额-1季度': 2123,
        //       '销售额-2季度': 1523,
        //       占比: 0.7,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月4日',
        //       '销售额-1季度': 4123,
        //       '销售额-2季度': 1523,
        //       占比: 0.31,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月5日',
        //       '销售额-1季度': 3123,
        //       '销售额-2季度': 1523,
        //       占比: 0.12,
        //       其他: 100,
        //     },
        //     {
        //       日期: '1月6日',
        //       '销售额-1季度': 7123,
        //       '销售额-2季度': 1523,
        //       占比: 0.65,
        //       其他: 100,
        //     },
        //   ],
        // },
      ],
    }
  },
  methods: {
    onViewDetail() {
      this.$router.push('/healthmonitor/detail')
    },
  },
}
</script>

<style lang="scss">
.chart-list {
  display: flex;
  flex-wrap: wrap;
  &_item {
    width: calc(50% - 10px);
    border: 1px solid #d7dae0;
    padding: 16px 20px;
    margin-top: 20px;
    // margin-top: 20px;
    // margin-left: 20px;
  }
  &_item:nth-of-type(even) {
    margin-left: 20px;
  }
}
</style>